Catalogs/ДокументыУдостоверяющиеЛичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДокументыУдостоверяющиеЛичность</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИмеетСерию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаСерииДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификаторВидовДУЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификаторВидовДУЛРЭМД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаКодаПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_МаскаИИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДокументыУдостоверяющиеЛичность/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.КлассификаторДокументовУдостоверяющихЛичность));
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.КлассификаторВидовДУЛ.ПараметрыВыбора = НовыеПараметры;
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.ДокументыУдостоверяющиеЛичность));
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.КлассификаторВидовДУЛРЭМД.ПараметрыВыбора = НовыеПараметры;
	
	// Добавлено Макеев (
	Элементы.КлассификаторВидовДУЛ.Видимость = Ложь;
	Элементы.КлассификаторВидовДУЛРЭМД.Видимость = Ложь;
	
	Эломг_МаскаИИН = Элементы.Добавить("омг_МаскаИИН", Тип("ПолеФормы"), ЭтаФорма);
	Эломг_МаскаИИН.Вид = ВидПоляФормы.ПолеВвода;
	Эломг_МаскаИИН.ПутьКДанным = "Объект.омг_МаскаИИН";
	Эломг_МаскаИИН.АвтоМаксимальнаяШирина = Ложь;
	Эломг_МаскаИИН.МаксимальнаяШирина = 10;
	
	
	Элементы.Переместить(Эломг_МаскаИИН, ЭтаФорма, Элементы.МаскаСерииДокумента); 
	
	Эломг_ДокументРК = Элементы.Добавить("омг_Страна", Тип("ПолеФормы"), ЭтаФорма);
	Эломг_ДокументРК.Вид = ВидПоляФормы.ПолеВвода; 
	Эломг_ДокументРК.Заголовок = "Страна гражданства";
	Эломг_ДокументРК.ПутьКДанным = "Объект.омг_Страна";

	// )
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НеИмеетСериюПриИзменении(Элемент)	
	
	Объект.МаскаСерииДокумента = "";
	Элементы.МаскаСерииДокумента.Доступность = Не Объект.НеИмеетСерию;
	
КонецПроцедуры

#КонецОбласти
